{
  "backend/main.mo": "Motoko actor handling admin bootstrap, access control, user profiles, question CRUD, and quiz submissions.",
  "feature_evidence.json": "Feature evidence describing files and components involved in implementing the initial admin bootstrap UI flow.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files including hooks, components, pages, and layout modules.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup with authentication-aware root component and role-based routing for admin and student areas.",
  "frontend/src/components/admin/InitializeAdminAccessBanner.tsx": "Banner allowing the first authenticated non-admin user to claim initial admin access using token validation and confirmation dialog.",
  "frontend/src/components/admin/QuestionFormDialog.tsx": "Dialog form for creating or editing questions with option management, validation, and API integration.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button that reacts to authentication state and handles login errors.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Shows a dialog prompting new authenticated users to enter and save their name.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps the app with navigation, admin banner, and routed content container.",
  "frontend/src/components/layout/RoleNavigation.tsx": "Renders navigation links based on user role with an account dropdown and logout handling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an actor tied to identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Provides hooks to check if an admin exists and to claim initial admin privileges.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity login/logout and exposes authentication state.",
  "frontend/src/hooks/useCallerRole.ts": "Fetches the caller’s role from the backend and derives admin, student, or guest flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements the Internet Identity context with login, logout, and identity loading logic.",
  "frontend/src/hooks/useQueries.ts": "Contains query and mutation hooks for user profiles, questions, submissions, and related updates.",
  "frontend/src/index.css": "Tailwind setup and theme variables defining light/dark design tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up QueryClient and Internet Identity provider.",
  "frontend/src/pages/AccessDenied.tsx": "Shows an access denied message and redirects users to their appropriate dashboard based on role.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard displaying question stats and links for managing questions and other admin tasks, with role-based access enforcement.",
  "frontend/src/pages/admin/QuestionManagement.tsx": "Provides CRUD management for questions, including listing, editing, deleting, and creating questions with admin-only access.",
  "frontend/src/pages/Landing.tsx": "Landing page with branding, login button, and feature descriptions for admins and students.",
  "frontend/src/pages/student/MyResults.tsx": "Shows a student's submission history and performance metrics like best and average scores, restricted to student users.",
  "frontend/src/pages/student/StudentDashboard.tsx": "Student dashboard summarizing available questions and personal performance, with navigation to quizzes and submissions.",
  "frontend/src/pages/student/TakeQuiz.tsx": "Student quiz page that loads questions, tracks selected answers, submits them, and displays results.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project state file describing features, requirements, and architecture notes for the aptitude website."
}