{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend UI flow to claim initial Admin access",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Provide an authenticated-only UI call-to-action to claim the initial Admin role when no Admin exists, with confirmation, success redirect, and user-friendly error handling.",
      "acceptanceCriteria": [
        "When the user is authenticated and the backend indicates no Admin exists, the UI shows a clear call-to-action (English text) to claim Admin access (e.g., “Initialize Admin Access”).",
        "Clicking the call-to-action prompts the user to confirm (to prevent accidental clicks) and then calls the backend bootstrap method.",
        "On success, the frontend invalidates/refetches the caller role query and redirects the user to the Admin Dashboard route (/admin).",
        "If the claim fails because an Admin already exists, show an English error message explaining that initialization is already complete and do not change the user’s role.",
        "If the claim fails for any other reason, show a non-technical English error message and allow retry."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the typed backend interface to include the new admin-bootstrap capabilities needed by the UI (a query capability to determine whether an Admin is initialized, and a shared capability to claim the initial Admin role). Keep naming aligned with the backend implementation so the actor typing supports the new calls."
        },
        {
          "path": "frontend/src/hooks/useAdminBootstrap.ts",
          "operation": "create",
          "description": "Add React Query hooks for (1) checking whether Admin initialization is complete and (2) claiming initial Admin access. Use the authorization component’s frontend patterns for authenticated actor usage and role-based flows (Verify the component's usage instructions before implementing). Ensure the claim mutation invalidates/refetches the cached caller role query on success."
        },
        {
          "path": "frontend/src/components/admin/InitializeAdminAccessBanner.tsx",
          "operation": "create",
          "description": "Create a small authenticated-only banner/card UI that appears only when the backend indicates no Admin exists, with an English call-to-action button (e.g., “Initialize Admin Access”). Include a confirmation prompt before triggering the claim call, and display English success/error messages. Handle the specific 'admin already exists' failure with a clear explanation and keep the user’s role unchanged; handle other failures with a non-technical retryable message. Compose existing UI components (e.g., Button/Card/Alert styles) without editing any files under frontend/src/components/ui (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Wire the InitializeAdminAccessBanner into the authenticated application shell so it can be reached without adding new routes. Place it above the routed content (<Outlet />) so authenticated users can see the call-to-action wherever they are when Admin is not initialized."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the post-claim navigation behavior is supported: after successful initialization (role refetch/invalidation), the existing role-based redirects bring the user to /admin. If needed, adjust routing/redirect logic to avoid redirect loops during the brief transition from user->admin, while keeping English-only UI text for any new messaging."
        }
      ]
    }
  ]
}